# Tidying

In [1]:
import pandas as pd

In [17]:
df = pd.DataFrame({'student_id': {0: 'a', 1: 'b', 2: 'c'},
                   'arabic': {0: 1, 1: None, 2: 5},
                   'english': {0: 2, 1: 4, 2: 6},
                   'french': {0: 3, 1: 4, 2: 5}})

In [18]:
df

  student_id  arabic  english  french
0          a     1.0        2       3
1          b     NaN        4       4
2          c     5.0        6       5

### wide to long data use pandas `melt`

In [19]:
cleanDf = pd.melt(df,id_vars="student_id",value_vars=["arabic","english","french"])

In [20]:
cleanDf

  student_id variable  value
0          a   arabic    1.0
1          b   arabic    NaN
2          c   arabic    5.0
3          a  english    2.0
4          b  english    4.0
5          c  english    6.0
6          a   french    3.0
7          b   french    4.0
8          c   french    5.0

In [21]:
cleanDf.rename(columns={"variable":"subject_name","value":"grade"},inplace=True)

In [22]:
cleanDf

  student_id subject_name  grade
0          a       arabic    1.0
1          b       arabic    NaN
2          c       arabic    5.0
3          a      english    2.0
4          b      english    4.0
5          c      english    6.0
6          a       french    3.0
7          b       french    4.0
8          c       french    5.0

In [23]:
cleanDf = cleanDf[cleanDf["grade"].notna()]

In [24]:
cleanDf

  student_id subject_name  grade
0          a       arabic    1.0
2          c       arabic    5.0
3          a      english    2.0
4          b      english    4.0
5          c      english    6.0
6          a       french    3.0
7          b       french    4.0
8          c       french    5.0

In [26]:
#how many subjects per student
cleanDf["student_id"].value_counts()

c    3
a    3
b    2
Name: student_id, dtype: int64

In [29]:
#mean grades per students
mean_geades_per_student = cleanDf.groupby("student_id")["grade"].mean()
mean_geades_per_student

student_id
a    2.000000
b    4.000000
c    5.333333
Name: grade, dtype: float64

In [31]:
#min grade per each subject
#max grade per each subject

min_geades_per_subject = cleanDf.groupby("subject_name")["grade"].min()
min_geades_per_subject

subject_name
arabic     1.0
english    2.0
french     3.0
Name: grade, dtype: float64

In [32]:
max_geades_per_subject  =  cleanDf.groupby("subject_name")["grade"].max()
max_geades_per_subject

subject_name
arabic     5.0
english    6.0
french     5.0
Name: grade, dtype: float64

In [34]:
min_max_grade_per_sub = cleanDf.groupby("subject_name").agg({"grade":['min','max']}).reset_index()
min_max_grade_per_sub

  subject_name grade
                 min  max
0       arabic   1.0  5.0
1      english   2.0  6.0
2       french   3.0  5.0

In [ ]:
df = pd.DataFrame({'student_id': {0: 'a', 1: 'b', 2: 'c'},
                   'class_a': {0: 1, 1: 3, 2: 5},
                   'class_b': {0: 2, 1: 4, 2: 6}})

  student_id  class_a  class_b
0          a        1        2
1          b        3        4
2          c        5        6

In [2]:
pc = pd.read_csv('data/tidy/average_arrival_delay.csv')
pc.head(3)

  airline  ATL   DEN  DFW   IAH   LAS  LAX  MSP   ORD   PHX  SFO
0      AA  4.0   9.0  5.0  11.0   8.0  3.0  1.0   8.0   5.0  3.0
1      AS  6.0  -3.0 -5.0   1.0   2.0 -3.0  6.0   2.0  -9.0  4.0
2      B6  NaN  12.0  4.0   NaN  11.0  2.0  NaN  23.0  20.0  5.0

### Exercises:

In [35]:
# convert wide table to long table with three columns ["airline","company_name","ave_delay"]

In [49]:
import pandas as pd

In [57]:
pc = pd.read_csv('data/tidy/average_arrival_delay.csv')

In [58]:
pc.head()

  airline  ATL   DEN   DFW   IAH   LAS  LAX   MSP   ORD   PHX  SFO
0      AA  4.0   9.0   5.0  11.0   8.0  3.0   1.0   8.0   5.0  3.0
1      AS  6.0  -3.0  -5.0   1.0   2.0 -3.0   6.0   2.0  -9.0  4.0
2      B6  NaN  12.0   4.0   NaN  11.0  2.0   NaN  23.0  20.0  5.0
3      DL  0.0  -3.0  10.0   3.0  -3.0  3.0  -1.0   7.0  -4.0  0.0
4      EV  7.0  14.0  10.0   3.0   NaN  NaN  10.0   8.0 -14.0  NaN

In [59]:
pc.columns

Index(['airline', 'ATL', 'DEN', 'DFW', 'IAH', 'LAS', 'LAX', 'MSP', 'ORD',
       'PHX', 'SFO'],
      dtype='object')

In [60]:
pc = pd.melt(pc,id_vars="airline",value_vars=['ATL', 'DEN', 'DFW', 'IAH', 'LAS', 'LAX', 'MSP', 'ORD',
       'PHX', 'SFO'],var_name="company_name", value_name='delay',)

In [61]:
pc.columns

Index(['airline', 'variable', 'value'], dtype='object')

In [42]:
pc.head()

  airline company_name  delay
0      AA          ATL    4.0
1      AS          ATL    6.0
2      B6          ATL    NaN
3      DL          ATL    0.0
4      EV          ATL    7.0

In [48]:
# count company_name per airline
count_airline = pc["airline"].value_counts()

In [43]:
pc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140 entries, 0 to 139
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   airline       140 non-null    object
 1   company_name  140 non-null    object
 2   delay         114 non-null    float64
dtypes: float64(1), object(2)
memory usage: 3.4+ KB

In [44]:
# drop missing rows
# pc = pc[pc["delay"].notna()]
pc = pc.dropna(subset=["delay"])
pc.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 114 entries, 0 to 139
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   airline       114 non-null    object
 1   company_name  114 non-null    object
 2   delay         114 non-null    float64
dtypes: float64(1), object(2)
memory usage: 3.6+ KB

In [36]:
#calculate max,min delay per company_name

In [45]:
min_max_delay_per_delay = pc.groupby("company_name").agg({"delay":['min','max']}).reset_index()
min_max_delay_per_delay

  company_name delay
                 min   max
0          ATL   0.0  26.0
1          DEN  -3.0  14.0
2          DFW  -5.0  26.0
3          IAH  -3.0  28.0
4          LAS  -5.0  13.0
5          LAX  -3.0  28.0
6          MSP  -3.0  72.0
7          ORD   2.0  23.0
8          PHX -14.0  20.0
9          SFO   0.0  15.0

In [37]:
#calculate max,min delay per airline

In [46]:
min_max_delay_per_airline = pc.groupby("airline").agg({"delay":['min','max']}).reset_index()
min_max_delay_per_airline

   airline delay
             min   max
0       AA   1.0  11.0
1       AS  -9.0   6.0
2       B6   2.0  23.0
3       DL  -4.0  10.0
4       EV -14.0  14.0
5       F9   1.0  35.0
6       HA   1.0  13.0
7       MQ   6.0  72.0
8       NK   4.0  28.0
9       OO  -3.0  23.0
10      UA   0.0  13.0
11      US  -5.0   4.0
12      VX   2.0  19.0
13      WN  -0.0  11.0